Revit 2027 API
ExportLinetypeTable.ContainsKey Method
 Checks whether a pattern key exists in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsKey(
	ExportLinetypeKey exportLinetypeKey
)
Public Function ContainsKey (
	exportLinetypeKey As ExportLinetypeKey
) As Boolean
public:
bool ContainsKey(
	ExportLinetypeKey^ exportLinetypeKey
)
member ContainsKey :
        exportLinetypeKey : ExportLinetypeKey -> bool
Parameters
exportLinetypeKey ExportLinetypeKey
 The export line type key.
Return Value
Boolean
 True if the line type exists in the table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace